In [1]:
from pandas import *
from numpy import *

In [9]:
emp = read_csv("./SQL_to_CSV/emp.csv")
emp

   EmployeeID EmployeeName  DepartmentID
0           1        Alice         101.0
1           2          Bob         102.0
2           3      Charlie         103.0
3           4       Daniel           NaN
4           5       Evelyn         101.0
5           6       Fraser         102.0
6           7       George         101.0

In [10]:
dept = read_csv("./SQL_to_CSV/dept.csv")
dept

   DepartmentID DepartmentName  LocationID
0           101             HR         201
1           102    Engineering         202
2           103      Marketing         203
3           104             IT         204

In [12]:
dept1 = read_csv("./SQL_to_CSV/dept.csv",usecols=['DepartmentID','DepartmentName'])
dept1

   DepartmentID DepartmentName
0           101             HR
1           102    Engineering
2           103      Marketing
3           104             IT

### Types of Joins
- 'left': Use keys from the left DataFrame.
- 'right': Use keys from the right DataFrame.
- 'outer': Use union of keys from both DataFrames.
- 'inner': Use intersection of keys from both DataFrames.
- 'cross': Creates the Cartesian product of the rows of both DataFrames (new in pandas 1.2.0).

In [24]:
# By Default its inner join
emp.merge(dept1, how = 'inner')

   EmployeeID EmployeeName  DepartmentID DepartmentName
0           1        Alice         101.0             HR
1           2          Bob         102.0    Engineering
2           3      Charlie         103.0      Marketing
3           5       Evelyn         101.0             HR
4           6       Fraser         102.0    Engineering
5           7       George         101.0             HR

>pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,  
            left_index=False, right_index=False, sort=False,  
            suffixes=('_x', '_y'), copy=True, indicator=False,  
            validate=None)

In [33]:
salary = read_csv("./SQL_to_CSV/salary.csv")
salary

   EmployeeID  AnnualSalary
0           1       60000.0
1           2       80000.0
2           3       75000.0

In [35]:
j1 = emp.merge(dept)
j2 = j1.merge(salary)

j2

,EmployeeID,EmployeeName,DepartmentID,DepartmentName,LocationID,AnnualSalary
0,1,Alice,101.0,HR,201,60000.0
1,2,Bob,102.0,Engineering,202,80000.0
2,3,Charlie,103.0,Marketing,203,75000.0

In [46]:
concat([emp,dept])

array([[1, 'Alice', 101.0],
       [2, 'Bob', 102.0],
       [3, 'Charlie', 103.0],
       [4, 'Daniel', nan],
       [5, 'Evelyn', 101.0],
       [6, 'Fraser', 102.0],
       [7, 'George', 101.0],
       [101, 'HR', 201],
       [102, 'Engineering', 202],
       [103, 'Marketing', 203],
       [104, 'IT', 204]], dtype=object)